alice_in_wonderland = ("\"Would you tell me, please, which way I ought to go from here?\"\n"
                       "\"That depends a good deal on where you want to get to,\" said the Cat.\n"
                       "\"I don't much care where ——\" said Alice.\n"
                       "\"Then it doesn't matter which way you go,\" said the Cat.\n"
                       "\"—— so long as I get somewhere,\" Alice added as an explanation.\n"
                       "\"Oh, you're sure to do that,\" said the Cat, \"if you only walk long enough.\"")

print("1)", alice_in_wonderland)
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та екрануйте всі символи одинарної дужки у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк


"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
square_black = 436402
square_azov = 37800
total_square = square_azov + square_black
print(f"2) Щоб знайти загальну площу Чорного та Азовського морів, просто додайте їх площі разом ",
      f"Відповідь: {total_square:,}", ' кілометрів²')

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
total_goods = 375291

first_second = 250449

second_third = 222950

x = total_goods - second_third

y = first_second - x

t = total_goods - first_second

print(f"3) Кількість товарів на першому складі: {x:,}")
print(f"Кількість товарів на другому складі: {y:,}")
print(f"Кількість товарів на третьому складі: {t:,}")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
monthly_payment = 1179

months = 18

total_cost = monthly_payment * months

print(f"4) Щоб обчислити вартість комп'ютера,"
      f"необхідно помножити суму щомісячного платежу на кількість місяців, "
      f"протягом яких будуть здійснюватися ці платежі.Вартість комп'ютера: {total_cost:,} грн")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9

print(f"7)A = {a}\"\n",
      f"B = {b}\"\n",
      f"C = {c}\"\n"
      f"D = {d}\"\n"
      f"E = {e}\"\n"
      f"F = {f}")

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
pizza_big = 1096 # 274*4 =1096

pizza_mid = 436 # 218*2 =436

juice = 140 # 35*4 =140

cake = 350

water = 63 # 21*3=63

total = pizza_big + pizza_mid + juice + cake + water

print(f"8) Щоб порахувати скільки усього потрібно коштів, необхідно скласти усі ціни разом\"\n"
      f"Загальна сумма складає- {total:,} гривень")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_photos = 232

one_page = 8

total_page = 232 // 8

print(f"9) Щоб порахувати скільки сторінко знадобиться,необхідно загальну кількоість фотографій розділити "
      f"на кількість на одній сторінці.\"\n"
      f"Загальна кількість сторінок складає - {total_page:,}")
# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
distance_km = 1600

consumption_per_100km = 9

tank_capacity = 48

fuel_needed = (distance_km / 100) * consumption_per_100km

refuel_stops = fuel_needed / tank_capacity

refuel_stops = int(refuel_stops)

print(f"10) Для подорожі знадобиться {int(fuel_needed)} літрів бензину.")
print(f"Родині необхідно заїхати на заправку щонайменше {refuel_stops} рази.")
